Repository: Baraah7/AquaNav
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Bahaar
ar: بحار

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

source: English
ar: الإنجليزية

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Try Again
ar: حاول مرة أخرى

source: Loading...
ar: جاري التحميل...

source: Error
ar: خطأ

source: Success
ar: نجاح

source: No data available
ar: لا توجد بيانات

source: Close
ar: إغلاق

source: OK
ar: موافق

source: Reset
ar: إعادة تعيين

source: Save
ar: حفظ

source: Welcome to Bahaar
ar: مرحباً بك في بحار

source: Fishing Map
ar: خريطة الصيد

# fishingMapSubtitle
source: Interactive map with depth colors
ar: خريطة تفاعلية مع ألوان العمق

source: Weather
ar: الطقس

# weatherSubtitle
source: Check marine weather
ar: تحقق من طقس البحر

source: Fish Recognition
ar: التعرف على الأسماك

# fishRecognitionSubtitle
source: Identify fish species
ar: تعرف على أنواع الأسماك

source: Mariner Harvest
ar: حصاد البحار

# marinerHarvestSubtitle
source: Buy & sell fresh fish
ar: شراء وبيع الأسماك الطازجة

source: Sign Out
ar: تسجيل الخروج

source: Loading recognition model...
ar: جاري تحميل نموذج التعرف...

# takePhotoOfFish
source: Take a photo of fish or shrimp
ar: التقط صورة للسمكة أو الروبيان

# systemWillIdentify
source: The system will identify the species automatically
ar: سيتعرف النظام على النوع تلقائياً

source: Camera
ar: كاميرا

source: Gallery
ar: معرض

source: Analyzing...
ar: جاري التحليل...

source: New Image
ar: صورة جديدة

source: Supported Species
ar: الأنواع المدعومة

source: Confidence
ar: دقة التعرف

# tryTakingClearerPhoto
source: Try taking a clearer photo for better results
ar: جرب التقاط صورة أوضح للحصول على نتيجة أدق

# failedToLoadModel
source: Failed to load recognition model
ar: فشل تحميل نموذج التعرف

source: Failed to open camera
ar: فشل فتح الكاميرا

source: Failed to select image
ar: فشل اختيار الصورة

source: Model not ready
ar: النموذج غير جاهز

source: Classification failed
ar: فشل التصنيف

# hourlyForecast
source: Next 24 Hours
ar: الـ 24 ساعة القادمة

# dailyForecast
source: Day Forecast
ar: توقعات الأيام

source: Wind
ar: الرياح

source: UV Index
ar: مؤشر الأشعة

source: Feels Like
ar: الإحساس

source: Humidity
ar: الرطوبة

source: Visibility
ar: الرؤية

source: Sunrise
ar: الشروق

source: Sunset
ar: الغروب

source: Unable to load weather
ar: تعذر تحميل الطقس

source: Change Language
ar: تغيير اللغة

source: Select Language
ar: اختر اللغة

source: Account
ar: الحساب

source: Notifications
ar: الإشعارات

source: About
ar: حول التطبيق

source: Version
ar: الإصدار

source: Sign In
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Continue as Guest
ar: المتابعة كضيف

source: Navigation Ready
ar: الملاحة جاهزة

source: Calculating route...
ar: جاري حساب المسار...

source: Port Navigation
ar: ملاحة الميناء

# selectPortInstruction
source: 1. Select a port (anchor icon) 2. Tap sea destination on map
ar: 1. اختر ميناء (رمز المرساة) 2. انقر على وجهة بحرية على الخريطة

# tapSeaDestination
source: 2. Tap sea destination on map
ar: 2. انقر على وجهة بحرية على الخريطة

# pleaseSelectWaterDestination
source: Please select a water destination
ar: يرجى اختيار وجهة مائية

# seaDestinationSet
source: Sea destination set. Select a port to start from.
ar: تم تحديد الوجهة البحرية. اختر ميناء للبدء منه.

source: Port selected
ar: تم اختيار الميناء

source: Location not available
ar: الموقع غير متاح

# couldNotFindRoute
source: Could not find a route
ar: تعذر إيجاد مسار

source: Error calculating route
ar: خطأ في حساب المسار

# couldNotFindLandRoute
source: Could not find land route to port
ar: تعذر إيجاد مسار بري للميناء

# couldNotFindMarineRoute
source: Could not find marine route from port
ar: تعذر إيجاد مسار بحري من الميناء

source: Route calculated
ar: تم حساب المسار

source: Navigation started
ar: بدأت الملاحة

source: Failed to start navigation
ar: فشل بدء الملاحة

source: Reset Mask?
ar: إعادة تعيين القناع؟

# resetMaskConfirmation
source: This will discard all your changes and restore the original mask.
ar: سيؤدي هذا إلى تجاهل جميع تغييراتك واستعادة القناع الأصلي.

source: Mask saved successfully
ar: تم حفظ القناع بنجاح

source: Failed to save mask
ar: فشل حفظ القناع

source: Mask reset to original
ar: تمت إعادة القناع للأصلي

source: Failed to reset mask
ar: فشل إعادة تعيين القناع

# selectBothPortAndDestination
source: Please select both port and sea destination
ar: يرجى اختيار الميناء والوجهة البحرية

source: Current location not available
ar: الموقع الحالي غير متاح

source: Marketplace
ar: السوق

source: Sell Fish
ar: بيع سمك

source: My Orders
ar: طلباتي

source: Search fish, seller, location...
ar: ابحث عن سمك، بائع، موقع...

source: Type
ar: النوع

source: Condition
ar: الحالة

source: Clear Filters
ar: مسح الفلاتر

source: Filter by Fish Type
ar: تصفية حسب نوع السمك

source: All Types
ar: جميع الأنواع

source: Filter by Condition
ar: تصفية حسب الحالة

source: All Conditions
ar: جميع الحالات

source: No fish listings found
ar: لم يتم العثور على عروض أسماك

# tryAdjustingFilters
source: Try adjusting your filters
ar: جرب تعديل الفلاتر

source: No orders yet
ar: لا توجد طلبات بعد

# ordersWillAppearHere
source: Orders from buyers will appear here
ar: ستظهر طلبات المشترين هنا

source: Order Placed!
ar: تم الطلب!

source: You have ordered
ar: لقد طلبت

source: Weight
ar: الوزن

source: Total
ar: الإجمالي

source: Payment
ar: الدفع

# waitingForSeller
source: Waiting for seller to accept your order.
ar: في انتظار قبول البائع لطلبك.

# yourFishListingPosted
source: Your fish listing has been posted!
ar: تم نشر عرض السمك الخاص بك!

source: Order accepted!
ar: تم قبول الطلب!

source: Order rejected
ar: تم رفض الطلب

# orderCompleted
source: Order marked as completed!
ar: تم إكمال الطلب!

source: Reject Order
ar: رفض الطلب

# areYouSureRejectOrder
source: Are you sure you want to reject this order?
ar: هل أنت متأكد من رفض هذا الطلب؟

source: Reason (optional)
ar: السبب (اختياري)

source: Reject
ar: رفض

source: Accept
ar: قبول

source: Mark as Completed
ar: تعيين كمكتمل

source: Buyer
ar: المشتري

source: Payment Proof
ar: إثبات الدفع

source: Tap to view full image
ar: انقر لعرض الصورة كاملة

source: Seller Information
ar: معلومات البائع

source: Description
ar: الوصف

source: Your Information
ar: معلوماتك

source: Select Payment Method
ar: اختر طريقة الدفع

source: Buy Now
ar: اشتري الآن

source: Contact Seller
ar: تواصل مع البائع

source: Your Name
ar: اسمك

source: Phone Number
ar: رقم الهاتف

source: Delivery Location (optional)
ar: موقع التوصيل (اختياري)

source: Please enter your name
ar: يرجى إدخال اسمك

# pleaseEnterPhoneNumber
source: Please enter your phone number
ar: يرجى إدخال رقم هاتفك

source: Upload Payment Proof
ar: رفع إثبات الدفع

source: Required
ar: مطلوب

# pleaseUploadPaymentScreenshot
source: Please upload a screenshot of your Benefit Pay payment
ar: يرجى رفع لقطة شاشة لدفع Benefit Pay

source: Tap to upload screenshot
ar: انقر لرفع لقطة الشاشة

source: Payment proof uploaded
ar: تم رفع إثبات الدفع

# pleaseUploadPaymentProofScreenshot
source: Please upload your payment proof screenshot
ar: يرجى رفع لقطة شاشة إثبات الدفع

source: Price per kg
ar: السعر للكيلو

source: Total Price
ar: السعر الإجمالي

source: Catch Location
ar: موقع الصيد

source: Catch Date
ar: تاريخ الصيد

source: Cash
ar: نقداً

source: Benefit Pay
ar: بنفت باي

source: Pay with cash on delivery
ar: ادفع نقداً عند التسليم

source: Pay instantly via Benefit Pay
ar: ادفع فوراً عبر بنفت باي

source: Name
ar: الاسم

source: Phone
ar: الهاتف

source: Location
ar: الموقع

source: sales
ar: مبيعات

source: Fish Photos
ar: صور السمك

# addPhotosOfFish
source: Add photos of your fish (optional)
ar: أضف صور لسمكك (اختياري)

source: Add Photo
ar: إضافة صورة

source: Fish Details
ar: تفاصيل السمك

source: Fish Type
ar: نوع السمك

source: Custom Fish Name
ar: اسم السمك المخصص

# pleaseEnterFishName
source: Please enter the fish name
ar: يرجى إدخال اسم السمك

source: Weight (kg)
ar: الوزن (كجم)

source: Price per kg (BD)
ar: السعر للكيلو (د.ب)

source: Catch Location (optional)
ar: موقع الصيد (اختياري)

source: Description (optional)
ar: الوصف (اختياري)

source: Payment Methods
ar: طرق الدفع

source: Select accepted payment methods:
ar: اختر طرق الدفع المقبولة:

source: Accept cash payment
ar: قبول الدفع النقدي

source: Accept Benefit Pay
ar: قبول بنفت باي

# benefitPayQRCode
source: Benefit Pay QR Code / Payment Info
ar: رمز QR لبنفت باي / معلومات الدفع

source: Upload Benefit Pay QR Code
ar: رفع رمز QR لبنفت باي

# buyersWillSeeThis
source: Buyers will see this when they select Benefit Pay
ar: سيرى المشترون هذا عند اختيار بنفت باي

source: Post Listing
ar: نشر العرض

# yourLocation
source: Your Location (optional)
ar: موقعك (اختياري)

source: Invalid number
ar: رقم غير صالح

source: Guest
ar: ضيف

source: Signed in
ar: مسجل الدخول

source: Guest mode
ar: وضع الضيف

# areYouSureSignOut
source: Are you sure you want to sign out?
ar: هل أنت متأكد من تسجيل الخروج؟

source: Fresh
ar: طازج

source: Frozen
ar: مجمد

source: Live
ar: حي

source: Pending
ar: قيد الانتظار

source: Accepted
ar: مقبول

source: Rejected
ar: مرفوض

source: Completed
ar: مكتمل

source: Cancelled
ar: ملغي

source: min ago
ar: دقيقة مضت

source: hours ago
ar: ساعات مضت

source: days ago
ar: أيام مضت
